simmsb/tyrfing/vendor/avr-device/svd/attiny816.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU</name>
      <description>CPU</description>
      <baseAddress>0x00000034</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x9</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRCSCAN_NMI</name>
        <description>No Description.</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>BOD_VLM</name>
        <description>No Description.</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>PORTA_PORT</name>
        <description>No Description.</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>PORTB_PORT</name>
        <description>No Description.</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>PORTC_PORT</name>
        <description>No Description.</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>RTC_CNT</name>
        <description>No Description.</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>RTC_PIT</name>
        <description>No Description.</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>TCA0_LUNF_OVF</name>
        <description>No Description.</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TCA0_HUNF</name>
        <description>No Description.</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>TCA0_CMP0_LCMP0</name>
        <description>No Description.</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>TCA0_CMP1_LCMP1</name>
        <description>No Description.</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>TCA0_CMP2_LCMP2</name>
        <description>No Description.</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>TCB0_INT</name>
        <description>No Description.</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TCD0_OVF</name>
        <description>No Description.</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>TCD0_TRIG</name>
        <description>No Description.</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>AC0_AC</name>
        <description>No Description.</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>ADC0_RESRDY</name>
        <description>No Description.</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>ADC0_WCOMP</name>
        <description>No Description.</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>TWI0_TWIS</name>
        <description>No Description.</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TWI0_TWIM</name>
        <description>No Description.</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>SPI0_INT</name>
        <description>No Description.</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>USART0_RXC</name>
        <description>No Description.</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>USART0_DRE</name>
        <description>No Description.</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>USART0_TXC</name>
        <description>No Description.</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>NVMCTRL_EE</name>
        <description>No Description.</description>
        <value>25</value>
      </interrupt>
      <registers>
        <register>
          <name>CCP</name>
          <description>Configuration Change Protection</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CCP</name>
              <description>CCP signature</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPM</name>
                  <description>SPM Instruction Protection</description>
                  <value>157</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOREG</name>
                  <description>IO Register Protection</description>
                  <value>216</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPH</name>
          <description>Stack Pointer High</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>SPL</name>
          <description>Stack Pointer Low</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPUINT</name>
      <description>Interrupt Controller</description>
      <baseAddress>0x00000110</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LVL0RR</name>
              <description>Round-robin Scheduling Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CVT</name>
              <description>Compact Vector Table</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IVSEL</name>
              <description>Interrupt Vector Select</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LVL0PRI</name>
          <description>Interrupt Level 0 Priority</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LVL0PRI</name>
              <description>Interrupt Level Priority</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LVL1VEC</name>
          <description>Interrupt Level 1 Priority Vector</description>
          <addressOffset>0x3</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LVL1VEC</name>
              <description>Interrupt Vector with High Priority</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LVL0EX</name>
              <description>Level 0 Interrupt Executing</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LVL1EX</name>
              <description>Level 1 Interrupt Executing</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NMIEX</name>
              <description>Non-maskable Interrupt Executing</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
